In [ ]:
import pymongo
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [ ]:
client = pymongo.MongoClient("mongodb://webUser:xxx123xxx@cluster0-shard-00-00.algwo.mongodb.net:27017,cluster0-shard-00-01.algwo.mongodb.net:27017,cluster0-shard-00-02.algwo.mongodb.net:27017/myFirstDatabase?ssl=true&replicaSet=atlas-am4cb3-shard-0&authSource=admin&retryWrites=true&w=majority")
db=client.BikeStores
dfStaff = pd.DataFrame.from_records(db.staffs.find())
dfOrders= pd.DataFrame.from_records(db.orders.find())
dfOrdersItems= pd.DataFrame.from_records(db.order_items.find())

In [ ]:
dfStaff

                        _id  staff_id  first_name  ... active store_id manager_id
0  61b23c3565bc032cb5eb44ad         2      Mireya  ...      1        1        1.0
1  61b23c3565bc032cb5eb44ae         3       Genna  ...      1        1        2.0
2  61b23c3565bc032cb5eb44ac         1     Fabiola  ...      1        1        NaN
3  61b23c3565bc032cb5eb44b4         9       Layla  ...      1        3        7.0
4  61b23c3565bc032cb5eb44b0         5    Jannette  ...      1        2        1.0
5  61b23c3565bc032cb5eb44b3         8        Kali  ...      1        3        1.0
6  61b23c3565bc032cb5eb44b2         7      Venita  ...      1        2        5.0
7  61b23c3565bc032cb5eb44af         4      Virgie  ...      1        1        2.0
8  61b23c3565bc032cb5eb44b1         6   Marcelene  ...      1        2        5.0
9  61b23c3565bc032cb5eb44b5        10  Bernardine  ...      1        3        7.0

[10 rows x 9 columns]

In [ ]:
dfOrders

                           _id  order_id  ...  store_id  staff_id
0     61b23bc665bc032cb5eb3d29        18  ...         1         3
1     61b23bc665bc032cb5eb3d28        17  ...         1         3
2     61b23bc665bc032cb5eb3d3c        37  ...         2         6
3     61b23bc665bc032cb5eb3d50        57  ...         2         7
4     61b23bc665bc032cb5eb3d51        58  ...         2         6
...                        ...       ...  ...       ...       ...
1610  61b23bc665bc032cb5eb430f      1528  ...         3         8
1611  61b23bc665bc032cb5eb4318      1537  ...         2         6
1612  61b23bc665bc032cb5eb4347      1584  ...         1         3
1613  61b23bc665bc032cb5eb434e      1591  ...         1         2
1614  61b23bc665bc032cb5eb435b      1604  ...         2         7

[1615 rows x 9 columns]

In [ ]:
dfOrdersItems

                           _id  order_id  ...  list_price  discount
0     61b23d3965bc032cb5eb4872         2  ...      599.99      0.05
1     61b23d3965bc032cb5eb486c         1  ...      599.99      0.20
2     61b23d3965bc032cb5eb4888        12  ...     2899.99      0.10
3     61b23d3965bc032cb5eb4897        17  ...     1799.99      0.07
4     61b23d3965bc032cb5eb48af        25  ...     1549.00      0.20
...                        ...       ...  ...         ...       ...
4717  61b23d3a65bc032cb5eb5aa3      1593  ...     2799.99      0.10
4718  61b23d3a65bc032cb5eb5aae      1598  ...     3499.99      0.07
4719  61b23d3a65bc032cb5eb5abc      1602  ...      899.99      0.05
4720  61b23d3a65bc032cb5eb5ac9      1609  ...      749.99      0.20
4721  61b23d3a65bc032cb5eb5ad7      1613  ...      319.99      0.05

[4722 rows x 7 columns]

In [ ]:
dfVendite= pd.merge(dfOrders,dfOrdersItems,how="outer",on=["order_id"])
dfVendite["prezzo_totale"]=dfVendite["list_price"]*dfVendite["quantity"]*(1-dfVendite["discount"])

In [ ]:
dfVendite2=dfVendite.groupby(["store_id","order_date"]).sum()["prezzo_totale"].reset_index()
dfVendite2

      store_id order_date  prezzo_totale
0            1 2016-01-01     10231.0464
1            1 2016-01-03      1349.9820
2            1 2016-01-05      7199.9820
3            1 2016-01-06      6816.9225
4            1 2016-01-09       437.0907
...        ...        ...            ...
1049         3 2018-04-29     10937.3378
1050         3 2018-07-01      8597.9467
1051         3 2018-07-10       782.9820
1052         3 2018-11-28      6104.0354
1053         3 2018-12-28      6516.9667

[1054 rows x 3 columns]

In [ ]:
import calendar
dfVendite2['anno'] = pd.DatetimeIndex(dfVendite2['order_date']).year
dfVendite2['numero'] = pd.DatetimeIndex(dfVendite2['order_date']).month
dfVendite2['mese'] = dfVendite2['nMonth'].apply(lambda x: calendar.month_abbr[x])
dfVendite2

      store_id order_date  prezzo_totale  year  nMonth Month  anno  numero mese
0            1 2016-01-01     10231.0464  2016       1   Jan  2016       1  Jan
1            1 2016-01-03      1349.9820  2016       1   Jan  2016       1  Jan
2            1 2016-01-05      7199.9820  2016       1   Jan  2016       1  Jan
3            1 2016-01-06      6816.9225  2016       1   Jan  2016       1  Jan
4            1 2016-01-09       437.0907  2016       1   Jan  2016       1  Jan
...        ...        ...            ...   ...     ...   ...   ...     ...  ...
1049         3 2018-04-29     10937.3378  2018       4   Apr  2018       4  Apr
1050         3 2018-07-01      8597.9467  2018       7   Jul  2018       7  Jul
1051         3 2018-07-10       782.9820  2018       7   Jul  2018       7  Jul
1052         3 2018-11-28      6104.0354  2018      11   Nov  2018      11  Nov
1053         3 2018-12-28      6516.9667  2018      12   Dec  2018      12  Dec

[1054 rows x 9 columns]

In [ ]:
dfGroupby = dfVendite2.groupby(['anno','numero','mese']).sum()
dfGroupby

                  store_id  prezzo_totale    year  nMonth
anno numero mese
2016 1      Jan         56    215146.4241   64512      32
     2      Feb         66    156112.3228   72576      72
     3      Mar         73    180600.3285   76608     114
     4      Apr         61    167144.0512   70560     140
     5      May         65    205270.0091   66528     165
     6      Jun         61    210562.1245   64512     192
     7      Jul         59    199556.8089   60480     210
     8      Aug         88    225657.3767   86688     344
     9      Sep         88    273091.6097   90720     405
     10     Oct         76    212078.0805   86688     430
     11     Nov         58    182329.4124   62496     341
     12     Dec         61    199829.9792   68544     408
2017 1      Jan         68    285616.4840   76646      38
     2      Feb         71    312923.7470   72612      72
     3      Mar         84    308911.9018   86731     129
     4      Apr         68    227290.9131   68578     136
     5      May         73    268233.2379   82697     205
     6      Jun         82    378865.6535   80680     240
     7      Jul         55    229995.3979   62527     217
     8      Aug         72    290553.4554   76646     304
     9      Sep         69    293405.2561   72612     324
     10     Oct         69    310328.3090   72612     360
     11     Nov         64    281577.9019   70595     385
     12     Dec         61    259505.9849   70595     420
2018 1      Jan         75    381430.0993   78702      39
     2      Feb         55    200658.0615   60540      60
     3      Mar         78    363990.9935   82738     123
     4      Apr        102    817921.8604  115026     228
     6      Jun          2       188.9910    2018       6
     7      Jul          8     11337.9002    8072      28
     8      Aug          4      8377.8147    4036      16
     9      Sep          2      8963.9647    2018       9
     10     Oct          1      3781.1284    2018      10
     11     Nov          5     11362.0071    4036      22
     12     Dec          3      6516.9667    2018      12